Revit 2027 API
ConnectionInputPoint(XYZ) Constructor
 Construct an input point from 3d point. A new valid id will be auto-generated.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionInputPoint(
	XYZ pt
)
Public Sub New (
	pt As XYZ
)
public:
ConnectionInputPoint(
	XYZ^ pt
)
new :
        pt : XYZ -> ConnectionInputPoint
Parameters
pt XYZ
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConnectionInputPoint Class
ConnectionInputPoint Overload
Autodesk.Revit.DB.Structure Namespace